app/controllers/books_controller.rb

SELECT "list_books".* FROM "list_books" WHERE "list_books"."book_id" = $1  [["book_id", 35]]
---
    def index
        books = Book.all